anhpt26-zz/Apollo3_D10/boards/Apollo3_D10/device/d10_new/include/dx_fw_defs.h
/**
 * dx_fw_defs.h  --  register, mask, modes defines etc.
 *
 * Copyright (C) 2016 DSP Group
 * All rights reserved.
 *
 * Unauthorized copying of this file is strictly prohibited.
 */

#ifndef _DX_FW_DEFS_H
#define _DX_FW_DEFS_H

#include <stdint.h>

// Command Registers of DBMDX
#define FW_VERSION_NUMBER_00 			0X00
#define OPERATION_MODE_01 				0X01
#define PRIMARY_ACOUSTIC_MODEL_SIZE_02 	0X02
#define MICROPHONE_MUTE_DURATION_03		0x03
#define DIGITAL_GAIN_04 				0X04
#define REG_IO_PORT_ADDR_LO_05			0X05
#define REG_FW_RECORD_A_05				0X05
#define FW_MINOR_VERSION_NUMBER_05		0X05
#define REG_IO_PORT_ADDR_HI_06			0X06
#define REG_FW_RECORD_B_06				0X06
#define FW_RC_VERSION_NUMBER_06		    0X06
#define REG_FW_RECORD_C_07				0X07
#define REG_IO_PORT_VALUE_LO_07			0X07
#define REG_IO_PORT_VALUE_HI_08			0X08
#define AUDIO_BUFFER_SIZE_09			0X09
#define NUMBER_OF_SAMPLES_IN_BUFFER_0A 	0X0A
#define UART_BAUD_RATE_0C		 		0x0c
#define FW_STATUS_INDEX_0D		 		0x0d
#define MICROPHONE_AUTO_SET_0E			0x0E
#define LOAD_BINARY_FILE_0F 			0X0F
#define DSP_CLOCK_CONFIG_10				0X10
#define AUDIO_PROCESSING_ROUTING_11    	0x11
#define EVENTS_INDICATIONS_EN_CFG_12 	0X12
#define AUDIO_STREAMING_SOURCE_SELECTION_13 	0x13
#define DETECTION_AND_SYSTEM_EVENTS_STATUS_14	0x14
#define EVENTS_INDICATION_GPIO_15		0X15
#define MICROPHONE_ANALOG_GAIN_16 		0x16
#define FW_DEBUG_REGISTER_2_17			0x17
#define FW_DEBUG_REGISTER_18			0x18
#define CHIP_ID_NUMBER_19 				0x19
#define HIGH_PASS_FILTER_1A				0x1A
#define MASTER_CLOCK_FREQUENCY_1B		0x1B
#define TDM_SCLK_CLOCK_FREQUENCY_1D 	0x1D
#define DSP_CLOCK_CONFIG_EXTENSION_1E	0x1E
#define AUDIO_ROUTING_CONFIGURATION_1F	0x1F
#define READ_AUDIO_BUFFER_20			0X20
#define GENERAL_CONFIGURATION_1_22 		0X22
#define GENERAL_CONFIGURATION_2_23 		0X23
#define FIRST_MICROPHONE_CONFIG_24		0x24
#define SECOND_MICROPHONE_CONFIG_25		0x25
#define THIRD_MICROPHONE_CONFIG_26		0x26

// reg 5 and 6 to be configured before Vesper reg 28
#define CONFIG_VESPER_MIC_ENERGY_LOW_05  	0x5
#define CONFIG_VESPER_MIC_ENERGY_HIGH_06 	0x6
#define VESPER_MIC_CONFIG_28				0x28
#define HOST_INTERFACE_SUPPORT_29 			0x29
#define LDO_CONFIGURATION_2B				0x2B

#define UART_DEBUG_RECORDING_30 			0x30
#define TDM_ACTIVATION_CONTROL_31 			0x31
#define MEMORY_CONFIG_33					0x33
#define AUDIO_PROCESSING_CONFIGURATION_34	0x34
#define TDM_RX_CONFIG_36 					0x36
#define TDM_TX_CONFIG_37		 			0x37
#define BUFFERING_NORMAL_AMPLITUDE_38		0x38
#define SENSORY_WORDID_5B					0x5B
#define NORMAL_AMPLITUDE_CONFIG_38			0x38
#define INDIRECT_ACCESS_REGISTER_NUMBER_3D	0x3d
#define INDIRECT_ACCESS_REGISTER_WRITE_3E	0x3e
#define INDIRECT_ACCESS_REGISTER_READ_3F	0x3f
// Sensory commands registers
#define SENSORY_DUALTHRESHOLD 				0X45
#define SENSORY_INITIALIZED 				0X41

// VT Engine Registers		
#define VT_ENGINE_RECOGMODE					0x40
#define VT_ENGINE_INITIALIZED				0x41
#define VT_ENGINE_LPSD_VAD					0x42
#define VT_ENGINE_WORDID					0x5B
#define VT_ENGINE_PHRASE_LENGTH				0x67
#define SENSORY_ACTIVE_AMODEL				0x49
#define NONE_MODEL							0x0
#define ACTIVATE_PRIMARY_MODEL 				0x1
#define ACTIVATE_SECONDARY_MODEL 			0x2

#define SENSORY_WORDID_5B					0x5B
#define VT_ENGINE_PHRASE_LENGTH				0x67
#define ASRP_LIB_VER_100					0x100
#define ASRP_TUNING_VER_101					0x101
#define ASRP_NUM_OF_ERRS_104				0x104

#define ASRP_USER_DEFINED_DELAY_107			0x107
#define ASRP_OUTPUT_ROUTING_109				0x109
#define ASRP_OUTPUT_GAIN_DEST_SEL_10A 		0x10A
#define ASRP_OUTPUT_GAIN_DEST_VALUE_10B 	0x10B
#define ASRP_BLOCKID_LOW_PART_124			0x124
#define ASRP_BLOCKID_HIGH_PART_125			0x125
#define ASRP_ENABLE_OFFSET_126				0x126
#define ASRP_VALUE_127						0x127
#define ASRP_RECORDS_CHANNELS_128			0x128
#define ASRP_RECORDS_CHANNELS_2_129			0x129
#define ASRP_QED_Trigger_mode_140			0x140
#define ASRP_QED_Trigger_offset_mode_141	0x141
#define ASRP_QED_Trigger_length_142			0x142
#define ASRP_QED_OUT_detection_143			0x143
#define ASRP_QEPD_OUT_DELAY_144				0x144
#define ASRP_QEPD_OUT_GAIN_145	 			0x145

#define VT_MAPPING 							0x300
#define VT_GENERAL_CFG_304					0x304
#define VT_AUDIO_HISTORY_CFG_305			0x305
#define VT__RECORD_CFG_306 					0x306

// Register fileds specific values

// Binary file loading
#define BINARY_FILE_TAIL_LEN				2   // 5A 0B tail

// DBMDX Operation Modes command (Reg 1)
#define IDLE_MODE		0X00
#define DETECTION_MODE 	0X01
#define BUFFERING_MODE 	0X02
#define HIBERNATE_MODE	0X06

// MIC_MUTE_DUR   0x3
#define KEEP_CURRENT_DUR  0x800
#define MUTE_MIC1  0x1000
#define MUTE_MIC2  0x2000
#define MUTE_MIC3  0x3000
#define MUTE_MIC4  0x4000
#define MUTE_ALL_MICROPHONES  0x0
#define MIC_MUTE_TIME_10MS  0xA
#define NO_MUTE  0xA


// DIGITAL_GAIN  0x04
#define MUTE_MIC  			0x801
#define KEEP_CURRENT_GAIN  	0x0800
#define GAIN_AFFECTS_MIC1  	0x1000
#define GAIN_AFFECTS_MIC2  	0x2000
#define GAIN_AFFECTS_MIC3  	0x3000
#define GAIN_AFFECTS_MIC4  	0x4000
#define GAIN_AFFECTS_ALL_MICROPHONES  0xF000
#define DIGITAL_GAIN_3_DB  	0x30
#define DIGITAL_GAIN_10_DB  0xA0
#define DIGITAL_GAIN_20_DB  0x140

#define SIZE_TO_ALLOCATE_FOR_ACOUSTIC_MODEL 		0x492
#define SIZE_TO_ALLOCATE_FOR_TRIGGER_ACOUSTIC_MODEL	0x0532
#define GAIN_OF_12_DB 								0X18

// command for AUDIO_BUFFER_SIZE_09 (0x9)
#define AUDIO_BUFFER_1_SEC  	0x0800
#define AUDIO_BUFFER_1_5_SEC  	0xC00
#define AUDIO_BUFFER_2_SEC  	0x1000
#define AUDIO_BUFFER_2_5_SEC  	0x1400
#define AUDIO_BUFFER_3_SEC  	0x1800
#define AUDIO_BUFFER_4_SEC  	0x2000

// command for UART_BAUD_RATE_0C 
#define CHANGE_UART1_BAUDRATE  		0x8000
#define CHANGE_UART0_BAUDRATE  		0x0
#define UART0_UART_BAUD_RATE_115_200_hz  0x480
#define UART0_UART_BAUD_RATE_230_400_hz  0x900
#define UART0_UART_BAUD_RATE_460_800_hz  0x1200
#define UART0_UART_BAUD_RATE_780_000_hz  0x1E78
#define UART0_UART_BAUD_RATE_1_Mhz  0x2710
#define UART0_UART_BAUD_RATE_2_Mhz  0x4e20
#define UART0_UART_BAUD_RATE_3_Mhz  0x7530
#define UART1_UART_BAUD_RATE_100_Khz  0x64
#define UART1_UART_BAUD_RATE_200_Khz  0xc8
#define UART1_UART_BAUD_RATE_400_Khz  0x190
#define UART1_UART_BAUD_RATE_500_Khz  0x1F4
#define UART1_UART_BAUD_RATE_800_Khz  0x320
#define UART1_UART_BAUD_RATE_1_Mhz  0x3e8
#define UART1_UART_BAUD_RATE_2_Mhz  0x7d0
#define UART1_UART_BAUD_RATE_3_Mhz  0xbb8
#define UART1_UART_BAUD_RATE_4_Mhz  0xfa0

// old FW defines - for D8 --->
#define UART_BAUD_RATE_115_200_hz 	0x0480
#define UART_BAUD_RATE_230_400_hz 	0x0900
#define UART_BAUD_RATE_460_800_hz 	0x1200
#define UART_BAUD_RATE_921_600_hz 	0x2400
#define UART_BAUD_RATE_1_Mhz 		0x2710
#define UART_BAUD_RATE_2_Mhz 		0x4e20
#define UART_BAUD_RATE_3_Mhz 		0x7530
#define UART_BAUD_RATE_4_Mhz 		0x9c40
#define UART_BAUD_RATE_5_Mhz 		0xc350
// till here <---

// FW_STATUS_INDEX  0x0D
#define READ_FW_ERROR_COUNTER 			0x0000
#define GET_AMOUNT_OF_FREE_DATA_MEMORY 	0x0001
#define GET_AMOUNT_OF_FREE_AHB_MEMORY 	0x0002
#define GET_AMOUNT_OF_ALLOC_BLOCKS_IN_DTCM 	0x0003
#define GET_AMOUNT_OF_ALLOC_BLOCKS_IN_AHB 	0x0004
#define GET_MIC_ENR_LEVEL 					0x0005

