anhpt26-zz/Apollo3_D10/boards/Apollo3_D10/device/d10_new/include/dx_fw_defs.h
// commands for LOAD_BINARY_FILE_0F (0xF)
#define FILE_TYPE_DTE_PRIM_MODEL		  0x0
#define FILE_TYPE_DTE_SEC_MODEL			  0x1
#define FILE_TYPE_ASRP_PARAMS_PRIM_INIT   0x4
#define FILE_TYPE_ASRP_SEC_INIT			  0x5
#define FILE_TYPE_NNET_BINS				  0x6
#define FILE_TYPE_NNET_FEATURES			  0x7
#define FILE_TYPE_FW_CMD_SEQ			  0x30
#define FILE_TYPE_GENERIC_BIN			  0x31

#define FILE_NO_OP 						  0x0
#define FILE_LOAD_OR_REL_ONLY 			  0x40
#define FILE_INIT_OR_KILL_ONLY 	  		  0x80
#define FILE_LOAD_INIT_OR_KILL_REL 		  0xC0

#define MEM_TYPE_DTCM  				0x0
#define MEM_TYPE_AHB  				0x100
#define BLK_START_NUM_0 			0x0
#define BLK_START_NUM_1 			0x200

#define OP_TYPE_LOAD_FILE 			0x0
#define OP_TYPE_RELEASE_FILE 		0x800
#define LOAD_ENGINE_TYPE_VT1 		0x1000
#define LOAD_ENGINE_TYPE_VT2 		0x2000
#define LOAD_ENGINE_TYPE_VT3 		0x3000
#define LOAD_ENGINE_TYPE_ASRP 		0x4000
#define LOAD_ENGINE_TYPE_SED 		0x5000
#define VT_REG_MODEL_SELECT 0x13
#define GLASS_BREAK 0x0

#define VT1_REGS_OFFSET 			0x40
#define VT2_REGS_OFFSET 			0x80
#define VT3_REGS_OFFSET 			0xC0

#define VT_REG_INIT					0x1
#define VT_REG_TH					0x8
#define VT_REG_LL					0xA
#define VT_REG_WORD_ID				0x1B
#define VT_REG_PHRASE_LENGTH_27		0x27

#define VT_NUM_GLOBAL 				0x0000
#define VT_NUM_1 					0x2000
#define VT_NUM_2 					0x4000
#define VT_NUM_3 					0x6000
#define VT_NUM_NONE 				0xE000

// Clock values for register 10
#define USE_PLL_STEP_FROM_REG_0x1E   0xF000

// AUDIO_PROCESSING_ROUTING_11
#define IO_SET_0  	0x0
#define IO_SET_1  	0x1000
#define IO_SET_2  	0x2000
#define IO_SET_3  	0x3000
#define IO_SET_4  	0x4000
#define IO_SET_5  	0x5000
#define IO_SET_6  	0x6000
#define IO_SET_7  	0x7000
#define IO_SET_8  	0x8000
#define IO_3N_0_CP_0  0x0
#define IO_3N_0_CP_1  0x1
#define IO_3N_0_CP_2  0x2
#define IO_3N_0_CP_3  0x3
#define IO_3N_0_CP_4  0x4
#define IO_3N_0_CP_5  0x5
#define IO_3N_0_CP_6  0x6
#define IO_3N_0_CP_7  0x7
#define IO_3N_0_NO_CP 0xE
#define IO_3N_1_CP_0  0x0
#define IO_3N_1_CP_1  0x010
#define IO_3N_1_CP_2  0x020
#define IO_3N_1_CP_3  0x030
#define IO_3N_1_CP_4  0x040
#define IO_3N_1_CP_5  0x050
#define IO_3N_1_CP_6  0x060
#define IO_3N_1_CP_7  0x070
#define IO_3N_1_NO_CP 0x0E0
#define IO_3N_2_CP_0  0x0
#define IO_3N_2_CP_1  0x0100
#define IO_3N_2_CP_2  0x0200
#define IO_3N_2_CP_3  0x0300
#define IO_3N_2_CP_4  0x0400
#define IO_3N_2_CP_5  0x0500
#define IO_3N_2_CP_6  0x0600
#define IO_3N_2_CP_7  0x0700
#define IO_3N_2_NO_CP 0x0E00

// AUDIO_BUFFER_READOUT_CONFIGURATION_12 -- may be reduced (per WWE)
#define AUDIO_BUFFER_READOUT_START_FROM_POINT_OF_SWITCHING_TO_BUFFERING 0X00
#define AUDIO_BUFFER_READOUT_START_FROM_PHRASE_END_POINT 				0X01
#define AUDIO_BUFFER_READOUT_START_FROM_PHRASE_START_POINT 				0X02

// AUDIO_STREAMING_SOURCE_SELECT_13
#define NO_STREAM_CH_1    0xF
#define STREAM_CH_1_CP_0  0x0
#define STREAM_CH_1_CP_1  0x1
#define STREAM_CH_1_CP_2  0x2
#define STREAM_CH_1_CP_3  0x3
#define STREAM_CH_1_CP_4  0x4
#define STREAM_CH_1_CP_5  0x5
#define STREAM_CH_1_CP_6  0x6
#define STREAM_CH_1_CP_7  0x7
#define NO_STREAM_CH_2    0x0F0
#define STREAM_CH_2_CP_0  0x0
#define STREAM_CH_2_CP_1  0x010
#define STREAM_CH_2_CP_2  0x020
#define STREAM_CH_2_CP_3  0x030
#define STREAM_CH_2_CP_4  0x040
#define STREAM_CH_2_CP_5  0x050
#define STREAM_CH_2_CP_6  0x060
#define STREAM_CH_2_CP_7  0x070
#define NO_STREAM_CH_3    0x0F00
#define STREAM_CH_3_CP_0  0x0
#define STREAM_CH_3_CP_1  0x0100
#define STREAM_CH_3_CP_2  0x0200
#define STREAM_CH_3_CP_3  0x0300
#define STREAM_CH_3_CP_4  0x0400
#define STREAM_CH_3_CP_5  0x0500
#define STREAM_CH_3_CP_6  0x0600
#define STREAM_CH_3_CP_7  0x0700
#define NO_STREAM_CH_4    0xF000
#define STREAM_CH_4_CP_0  0x0
#define STREAM_CH_4_CP_1  0x1000
#define STREAM_CH_4_CP_2  0x2000
#define STREAM_CH_4_CP_3  0x3000
#define STREAM_CH_4_CP_4  0x4000
#define STREAM_CH_4_CP_5  0x5000
#define STREAM_CH_4_CP_6  0x6000
#define STREAM_CH_4_CP_7  0x7000

// GOOGLE_ALGORITHM  0x14
#define GOOGLE_ENABLE  	0x0001
#define GOOGLE_INIT  	0x0002
#define GOOGLE_DETECTED 0x0010

//DETECT_AND_SYS_EVENTS  0x14
#define PWRUP_COMP 		0x1
#define VT1_DET 		0x2
#define VT2_DET 		0x4
#define VT3_DET 		0x8
#define AEP_DET 		0x10
#define WARNING_EVENT 	0x4000
#define ERROR_EVENT 	0x8000

// EVENTS_INDICATION_GPIO_15
#define PRI_MODEL_DET_GPIO_NUM_1  	0x1
#define PRI_MODEL_DET_GPIO_NUM_4  	0x4
#define PRI_MODEL_DET_GPIO_NUM_14  	0xe
#define PRI_MODEL_DET_GPIO_NUM_16  	0x010
#define PRI_MODEL_DET_GPIO_NUM_15  	0xf
#define PRI_MODEL_DET_GPIO_NUM_20  	0x014
#define SET_PRI_GPIO  				0x080
#define SEC_MODEL_DET_GPIO_NUM_1  	0x0100
#define SEC_MODEL_DET_GPIO_NUM_14  	0xe00
#define SEC_MODEL_DET_GPIO_NUM_16  	0x1000
#define SEC_MODEL_DET_GPIO_NUM_15  	0x0f00
#define SEC_MODEL_DET_GPIO_NUM_20  	0x1400
#define SET_SEC_GPIO  				0x8000

#define EVENTS_GPIO_NUM_1 			0x1
#define EVENTS_GPIO_NUM_4 			0x4
#define EVENTS_GPIO_NUM_14 			0xe
#define EVENTS_GPIO_NUM_16 			0x10
#define EVENTS_GPIO_NUM_15 			0xf
#define EVENTS_GPIO_NUM_20 			0x14
#define EVENTS_GPIO_POL_HIGH 		0x0
#define EVENTS_GPIO_POL_LOW 		0x40
#define EN_EVENTS_GPIO 				0x80
#define DIS_EVENTS_GPIO 			0x0
#define FW_READY_GPIO_NUM_1 		0x100
#define FW_READY_GPIO_NUM_4 		0x400
#define FW_READY_GPIO_NUM_14 		0xe00
#define FW_READY_GPIO_NUM_16 		0x1000
#define FW_READY_GPIO_NUM_15 		0xf00
#define FW_READY_GPIO_NUM_10 		0xa00
#define FW_READY_GPIO_NUM_20 		0x1400
#define FW_READY_GPIO_POL_HIGH 		0x0
#define FW_READY_GPIO_POL_LOW 		0x4000
#define EN_FW_READY_GPIO 			0x8000
#define DIS_FW_READY_GPIO 			0x0

// Register 16 values
#define SD_GAIN_EN  	0x8000
#define SD_GAIN_MINUS_4_DB  0x0
#define SD_GAIN_MINUS_2_DB  0x0100
#define SD_GAIN_0_DB  0x0200
#define SD_GAIN_2_DB  0x0300
#define SD_GAIN_4_DB  0x0400
#define SD_GAIN_6_DB  0x0500
#define SD_GAIN_8_DB  0x0600
#define SD_GAIN_10_DB  0x0700
#define SD_GAIN_12_DB  0x0800
#define SD_GAIN_14_DB  0x0900
#define SD_GAIN_16_DB  0x0a00
#define SD_GAIN_18_DB  0x0b00
#define SD_GAIN_20_DB  0x0c00
#define SD_GAIN_22_DB  0x0d00
#define SD_GAIN_24_DB  0x0e00
#define SD_GAIN_26_DB  0x0f00
#define SD_GAIN_28_DB  0x1000
#define SD_GAIN_30_DB  0x1100
#define SD_GAIN_32_DB  0x1200
#define SD_GAIN_34_DB  0x1300
#define SD_GAIN_36_DB  0x1400
#define SAR_GAIN_EN  	0x080
#define SAR_GAIN_0_DB  	0x0
#define SAR_GAIN_6_DB  	0x1
#define SAR_GAIN_12_DB  0x2
#define SAR_GAIN_14_DB  0x3
#define SAR_GAIN_15_6_DB  0x4
#define SAR_GAIN_18_3_DB  0x5
#define SAR_GAIN_19_9_DB  0x6
#define SAR_GAIN_20_8_DB  0x7
#define SAR_GAIN_21_8_DB  0x8
#define SAR_GAIN_22_9_DB  0x9
#define SAR_GAIN_24_4_DB  0xa
#define SAR_GAIN_25_6_DB  0xb
#define SAR_GAIN_27_2_DB  0xc
#define SAR_GAIN_29_2_DB  0xd
#define SAR_GAIN_31_8_DB  0xe
#define SAR_GAIN_35_4_DB  0xf

// FW_DEBUG_REGISTER_2  0x17
#define PRINT_TDM_SW_SYNC_PATTERN 	0x1000
#define FORCE_DETECTION_INTERRUPT 	0x80

// values for FW_DEBUG_REGISTER_18
#define DUMP_APB_REGS 	0x1
#define DUMP_AHB_REGS 	0x2
#define FW_PRINT_CLOCK_SETTING 		0x4
#define TOGGLE_UART_DEBUG_PRINTS 	0x5
#define PRINT_MEM_INFO 				0xa
#define PRINT_MIPS_METER 			0x014

// HIGH_PASS_FILTER_1A
#define IIR_HPF_EN  		0x1
#define DC_REMOVE_COARSE_EN 0x2
#define DC_REMOVE_FINE_EN  	0x4
#define IIR_HPF_CUTOFF_FREQ_60HZ  0x0
#define IIR_HPF_CUTOFF_FREQ_30HZ  0x01000

// Clock values for register 1B
#define MCLK_32768Hz 		0x0020
#define MCLK_12288000Hz		0x3000
#define MCLK_13824000Hz		0x3600
#define MCLK_19200000Hz		0x4B00
#define MCLK_24576000Hz		0x6000

// clock extended values for register 0x1E
#define CLK_EXT_PLL_STEP_0   0x0000
#define CLK_EXT_PLL_STEP_1   0x0001
#define CLK_EXT_PLL_STEP_2   0x0002
#define CLK_EXT_PLL_STEP_3   0x0003
#define CLK_EXT_PLL_STEP_4   0x0004
#define CLK_EXT_PLL_STEP_5   0x0005
#define CLK_EXT_PLL_STEP_6   0x0006
#define CLK_EXT_PLL_STEP_7   0x0007
#define CLK_EXT_PLL_STEP_8   0x0008
#define CLK_EXT_PLL_STEP_9   0x0009
#define CLK_EXT_PLL_STEP_10   0x000A
#define CLK_EXT_PLL_STEP_11   0x000B
#define CLK_EXT_PLL_STEP_12   0x000C
#define CLK_EXT_PLL_STEP_13   0x000D
#define CLK_EXT_PLL_STEP_14   0x000E
#define CLK_EXT_PLL_STEP_15   0x000F
#define CLK_EXT_PLL_STEP_16   0x0010
#define CLK_EXT_PLL_STEP_17   0x0011
#define CLK_EXT_PLL_STEP_18   0x0012
#define CLK_EXT_PLL_STEP_19   0x0013
#define CLK_EXT_PLL_STEP_20   0x0014
#define CLK_EXT_PLL_STEP_21   0x0015
#define CLK_EXT_PLL_STEP_22   0x0016
#define CLK_EXT_PLL_STEP_23   0x0017
#define CLK_EXT_PLL_STEP_24   0x0018
#define CLK_EXT_PLL_STEP_25   0x0019
#define CLK_EXT_PLL_STEP_26   0x001A
#define CLK_EXT_PLL_STEP_27   0x001B
#define CLK_EXT_PLL_STEP_28   0x001C
#define CLK_EXT_PLL_STEP_29   0x001D
#define CLK_EXT_PLL_STEP_30   0x001E
#define CLK_EXT_PLL_STEP_31   0x001F
#define CLK_EXT_PLL_STEP_32   0x0020
#define CLK_EXT_PLL_STEP_33   0x0021
#define CLK_EXT_PLL_STEP_34   0x0022
#define CLK_EXT_PLL_STEP_35   0x0023
#define CLK_EXT_PLL_STEP_36   0x0024
#define CLK_EXT_PLL_STEP_37   0x0025
#define CLK_EXT_PLL_STEP_38   0x0026
#define CLK_EXT_PLL_STEP_39   0x0027
#define CLK_EXT_PLL_STEP_40   0x0028

