anhpt26-zz/Apollo3_D10/boards/Apollo3_D10/device/d10_new/include/dx_fw_defs.h
#define OSC_FREE_RUN   0x0800
#define PLL_OSC_SEL_PLL_OSC_OFF   0x0000
#define PLL_OSC_SEL_USE_PLL   0x1000
#define PLL_OSC_SEL_USE_OSC   0x2000
#define CLK_SEL_MCLK_IN   0x0000
#define CLK_SEL_TDM0_SCLK   0x4000
#define SRC_SET_KEEP_CUR_CLK_SRC   0x0000
#define SRC_SET_CONFIG_CLK_ACCORDING_TO_CLK_SEL   0x8000

// AUDIO_ROUTING_CONFIGURATION_1F  0x1F
#define SPK_CHAN  				0x1
#define D2_SET_TDM0_FOR_BYPASS  0x8
#define D2_SET_TDM1_FOR_BYPASS  0xc
#define D2_SET_TDM2_FOR_BYPASS  0x10
#define D2_SET_TDM3_FOR_BYPASS  0x14
#define TDM1_IOS_SHARED  		0x0
#define TDM1_IOS_NOT_SHARED  	0x20
#define TDM_BYPASS_EN  			0x040
#define TDM_BYPASS_MODE_TDM0_TO_TDM1_TDM2_TO_TDM3  0x0
#define TDM_BYPASS_MODE_TDM0_TO_TDM3_TDM2_TO_TDM1  0x080
#define MUSIC_IN_TDM0  			0x0
#define MUSIC_IN_TDM1  			0x0100
#define MUSIC_IN_TDM2  			0x0200
#define MUSIC_IN_TDM3  			0x0300
#define USE_TDM_MUSIC_TO_SYNC  	0x0400
#define TDM_SYNC_LEFT_CH  		0x0
#define TDM_SYNC_RIGHT_CH  		0x0800
#define TDM_SYNC_DELAY_1_CLKS_CYCLES  0x1000
#define TDM_SYNC_DELAY_2_CLKS_CYCLES  0x2000
#define TDM_SYNC_DELAY_3_CLKS_CYCLES  0x3000
#define TDM_SYNC_DELAY_4_CLKS_CYCLES  0x4000
#define TDM_SYNC_DELAY_5_CLKS_CYCLES  0x5000
#define TDM_SYNC_DELAY_6_CLKS_CYCLES  0x6000
#define TDM_SYNC_DELAY_7_CLKS_CYCLES  0x7000
#define TDM_SYNC_DELAY_8_CLKS_CYCLES  0x8000
#define TDM_SYNC_DELAY_9_CLKS_CYCLES  0x9000
#define TDM_SYNC_DELAY_10_CLKS_CYCLES  0xA000
#define TDM_SYNC_DELAY_11_CLKS_CYCLES  0xB000
#define TDM_SYNC_DELAY_12_CLKS_CYCLES  0xC000
#define TDM_SYNC_DELAY_13_CLKS_CYCLES  0xD000
#define TDM_SYNC_DELAY_14_CLKS_CYCLES  0xE000
#define TDM_SYNC_DELAY_15_CLKS_CYCLES  0xF000

// ENERAL_CONFIGURATION_1_22  0x22
#define MAX_NUMBER_OF_MIC_IS_0_OR_1 0x0
#define MAX_NUMBER_OF_MIC_IS_2  	0x1
#define MAX_NUMBER_OF_MIC_IS_4  	0x2
#define DSP_CLK_GEN_PLL  			0x0
#define DSP_CLK_GEN_RC_OSC  		0x020
#define IF_REQUIRED_WAKEUP  		0x040
#define AUD_BUF_READ_MODE_MODE_2  	0x0
#define AUD_BUF_READ_MODE_MODE_1_AND_2  	0x080
#define WAKEUP_POLARITY_ACTIVE_LOW  0x0
#define WAKEUP_POLARITY_ACTIVE_HIGH 0x0100
#define MEMORY_SLEEP_EN  			0x0200
#define INVERT_DETECTION_GPIOS_ACTIVE_LOW  	0x0400
#define INVERT_DETECTION_GPIOS_ACTIVE_HIGH  0x0
#define SEND_UART_CHG_SEQ  			0x0800
#define SPLIT_MIC_BUFFER  			0x1000

// GENERAL_CONFIGURATION_2_23
#define PLL_POST_DIV_0  0x0
#define PLL_POST_DIV_1  0x1
#define PLL_POST_DIV_2  0x2
#define PLL_POST_DIV_3  0x4
#define PLL_POST_DIV_4  0x4
#define PLL_POST_DIV_5  0x5
#define PLL_POST_DIV_6  0x6
#define PLL_POST_DIV_7  0x7
#define PLL_POST_DIV_8  0x8
#define PLL_POST_DIV_9  0x9
#define PLL_POST_DIV_10  0xa
#define PLL_POST_DIV_11  0xb
#define PLL_POST_DIV_12  0xc
#define PLL_POST_DIV_13  0xd
#define PLL_POST_DIV_14  0xe
#define PLL_POST_DIV_15  0xf
#define FW_VAD_TYPE_NO_VAD  0x0
#define FW_VAD_TYPE_HW_VAD0  0x020
#define FW_VAD_TYPE_FW_OR_VESPER  0x040
#define FW_VAD_TYPE_D6_HW_VAD1  0x060
#define DDF_SAMPLE_WIDTH_16_BIT  0x0
#define DDF_SAMPLE_WIDTH_24_BIT  0x080
#define MIC_SAMPLE_RATE_16K  0x0
#define MIC_SAMPLE_RATE_44_1K  0x0100
#define MIC_SAMPLE_RATE_48K  0x0200
#define MIC_SAMPLE_RATE_8K  0x0300
#define AUTO_MIPS_HWVAD_ENABLED  0x0400
#define RESET_DDF_DC  0x0800
#define WRITE_AUD_BUF_HDR  0x1000
#define D6_LDO_SETTING_INPUT_MIN_0_96V  0x2000
#define D6_LDO_SETTING_INPUT_MIN_1_03V  0x4000
#define D6_LDO_SETTING_INPUT_MIN_1_1V  0x6000

// Register 0x24 - 0x26 fields
#define D2_MIC_SRC_LEFT_DMIC_DM0  0x1
#define D2_MIC_SRC_RIGHT_DMIC_DM0  0x2
#define D2_MIC_SRC_LEFT_DMIC_DM1  0x3
#define D2_MIC_SRC_RIGHT_DMIC_DM1  0x4
#define D2_MIC_SRC_ANALOG_MIC_DM2  0x5
#define D2_DM_DATA_SRC_DM0_TDM2_RX  0x0
#define D2_DM_DATA_SRC_DM1_TDM0_FSYNC  0x0
#define D2_DM_DATA_SRC_DM2_HIGH_IMPEDANCE  0x0
#define D2_DM_DATA_SRC_DM0_TDM3_FSYNC  0x8
#define D2_DM_DATA_SRC_DM1_TDM3_RX  0x8
#define D2_DM_DATA_SRC_DM2_MID_IMPEDANCE  0x8
#define D2_DM_CLK_SRC_DM0_TDM2_TX  0x0
#define D2_DM_CLK_SRC_DM1_TDM0_TX  0x0
#define D2_DM_CLK_SRC_DM0_TDM3_SCLK  0x010
#define D2_DM_CLK_SRC_DM1_TDM3_TX  0x010

#define DDF_AND_DM_CONFIG_DDF0_DM0  0x1
#define DDF_AND_DM_CONFIG_DDF0_DM1  0x2
#define DDF_AND_DM_CONFIG_DDF1_DM0  0x3
#define DDF_AND_DM_CONFIG_DDF1_DM1  0x4
#define DDF_AND_DM_CONFIG_SD_DDF_DM0  0x5
#define DDF_AND_DM_CONFIG_SD_DDF_DM1  0x6
#define DDF_AND_DM_CONFIG_SD_DDF_SD_ADC  0x7
#define DDF_AND_DM_CONFIG_SAR_DDF_SAR_ADC  0x8
#define D10L_DDF_AND_DM_CONFIG_DDF0_DM0  0x1
#define D10L_DDF_AND_DM_CONFIG_DDF1_DM0  0x2
#define D10L_DDF_AND_DM_CONFIG_DDF2_DM1  0x3
#define D10L_DDF_AND_DM_CONFIG_DDF3_DM1  0x4
//RSVD1					    0x0005
//RSVD1					    0x0006
//RSVD1					    0x0007
#define D10L_DDF_AND_DM_CONFIG_SAR0_D10L_DDF_SAR_ADC  0x8
#define D10L_DDF_AND_DM_CONFIG_SAR1_D10L_DDF_SAR_ADC  0x9

#define CLOCK_POLARITY_RISING_EDGE  0x0
#define CLOCK_POLARITY_FALLING_EDGE  0x010

#define DM_CLK_FREQ_512_SR_8KHz_16KHz  0x0
#define DM_CLK_FREQ_768_SR_8KHz_16KHz  0x020
#define DM_CLK_FREQ_1024_1040_SR_16KHz_32KHz_48KHz  0x040
#define DM_CLK_FREQ_1536_1200_SR_8KHz_16KHz_32KHz_48KHz  0x060
#define DM_CLK_FREQ_2304_2352_SR_16KHz_32KHz_48KHz  0x080
#define DM_CLK_FREQ_3072_SR_16KHz_32KHz_48KHz  0x0a0
#define SAR_IIR_FILTER_128  0x0
#define SAR_IIR_FILTER_256  0x020
#define SAR_IIR_FILTER_SD_ALIGN_D8D  0x040
#define SAR_IIR_FILTER_64_FOR_TDM0_44_1  0x080
#define SYNCED_START		0x0100
#define NO_SYNCED_START		0x0000
#define DDF_AUDIO_ATTENUATION_6dB_GAIN  0x0
#define DDF_AUDIO_ATTENUATION_0dB  0x0200
#define DDF_AUDIO_ATTENUATION_MINUS_6dB  0x0400
#define DDF_AUDIO_ATTENUATION_MINUS_12dB  0x0600
#define SAR_ADC_SEL_MAIN 	0x0
#define SAR_ADC_SEL_SEC 	0x800

#define DM_DATA_SRC_DM0_GPIO2_DM1_GPIO1  0x0
#define DM_DATA_SRC_DM0_GPIO5_DM1_GPIO11  0x1000
#define DM_DATA_SRC_DM0_GPIO9_DM1_GPIO13  0x2000
#define DM_DATA_SRC_DM0_GPIO20_DM1_GPIO18  0x3000
#define DM_CLOCK_SRC_DM0_GPIO6_DM1_GPIO0  0x0
#define DM_CLOCK_SRC_DM0_GPIO6_DM1_GPIO12  0x4000
#define DM_CLOCK_SRC_DM0_GPIO8_DM1_GPIO14  0x8000
#define DM_CLOCK_SRC_DM0_GPIO19_DM1_GPIO17  0xC000

#define CLOSING_MICS_NO_DM_CLOCK  0x200
#define CLOSING_MICS_SAR_LOW_AMP  0x0

// VT_REG_PHRASE_LENGTH_27
#define USER_CFG_WWE_LENGTH_500_MS 		0x2000
#define USER_CFG_WWE_LENGTH_750_MS 		0x3000
#define USER_CFG_WWE_LENGTH_1S 			0x4000

#define T3_T4_INP_FREQ_29 	0x29
#define SED_REC_CONTROL 0x28
#define SED_MODEL_TYPE  0x31
#define INP_FREQ_16K 	0x0
#define INP_FREQ_48K 	0x1

