anhpt26-zz/Apollo3_D10/boards/Apollo3_D10/device/d10_new/include/dx_fw_defs.h
#define SED_MODEL_TYPE_NNET 	0x0
#define SED_MODEL_TYPE_DSPSENSE 0x1

#define DOS_EN_DIS_29 				0x29
#define DOS_MSG_LEN 				0x2A
#define DOS_READ_WRITE_MSG_SYMBOLS  0x2B

// VESPER_MIC_CONFIG_28 : reg 5 and 6 to be configured before Vesper reg 28
#define CONFIG_VESPER_MIC_ENERGY_LOW_05  	0x5
#define CONFIG_VESPER_MIC_ENERGY_HIGH_06 	0x6

#define MODE_GPIO_NUM_0  0x0000
#define MODE_GPIO_NUM_1  0x0001
#define MODE_GPIO_NUM_2  0x0002
#define MODE_GPIO_NUM_3  0x0003
#define MODE_GPIO_NUM_4  0x0004
#define MODE_GPIO_NUM_5  0x0005
#define MODE_GPIO_NUM_6  0x0006
#define MODE_GPIO_NUM_7  0x0007
#define MODE_GPIO_NUM_8  0x0008
#define MODE_GPIO_NUM_9  0x0009
#define MODE_GPIO_NUM_10  0x000a
#define MODE_GPIO_NUM_11  0x000b
#define MODE_GPIO_NUM_12  0x000c
#define MODE_GPIO_NUM_13  0x000d
#define MODE_GPIO_NUM_14  0x000e
#define MODE_GPIO_NUM_15  0x000f
#define MODE_GPIO_NUM_16  0x0010
#define MODE_GPIO_NUM_17  0x0011
#define MODE_GPIO_NUM_18  0x0012
#define MODE_GPIO_NUM_19  0x0013
#define MODE_GPIO_NUM_20  0x0014
#define MODE_GPIO_NUM_21  0x0015
#define MODE_GPIO_NUM_22  0x0016
#define MODE_GPIO_NUM_23  0x0017
#define MODE_GPIO_NUM_24  0x0018

#define DET_GPIO_NUM_0  0x0
#define DET_GPIO_NUM_1  0x20
#define DET_GPIO_NUM_2  0x40
#define DET_GPIO_NUM_3  0x60
#define DET_GPIO_NUM_4  0x80
#define DET_GPIO_NUM_5  0xa0
#define DET_GPIO_NUM_6  0xc0
#define DET_GPIO_NUM_7  0xe0
#define DET_GPIO_NUM_8  0x100
#define DET_GPIO_NUM_9  0x120
#define DET_GPIO_NUM_10  0x140
#define DET_GPIO_NUM_11  0x160
#define DET_GPIO_NUM_12  0x180
#define DET_GPIO_NUM_13  0x1a0
#define DET_GPIO_NUM_14  0x1c0
#define DET_GPIO_NUM_15  0x1e0
#define DET_GPIO_NUM_16  0x200
#define DET_GPIO_NUM_17  0x220
#define DET_GPIO_NUM_18  0x240
#define DET_GPIO_NUM_19  0x260
#define DET_GPIO_NUM_20  0x280
#define DET_GPIO_NUM_21  0x2a0
#define DET_GPIO_NUM_22  0x2c0
#define DET_GPIO_NUM_23  0x2e0
#define DET_GPIO_NUM_24  0x300

#define SIL_TIME_THD_250MS  0x1000
#define SIL_TIME_THD_500MS  0x2000
#define SIL_TIME_THD_1000MS  0x4000
#define SIL_TIME_THD_2000MS  0x8000
#define SIL_TIME_THD_4000MS  0xf000

// command for 29_HOST_INTERFACE_SUPPORT (0x29)
#define HOST_INTERFACE_I2C  0X02
#define HOST_INTERFACE_UART 0X01
#define HOST_INTERFACE_SPI  0X20
#define UART_DEBUG_MODE_0	0x1000
#define UART_DEBUG_MODE_1 	0x2000
#define UART_EN_UART_1_Rx 	0x4000


#define UART0_ENABLE_FOR_HOST_D2_TDM2_D4_D6_GPIO_17_18_D10_GPIO_2_5 0x1
#define I2C_D2_ON_I2C_SDA_SCK_D4_D6_GPIO_1_2_D10_GPIO_3_4 			0x2
#define SLIMBUS_D2_TDM0_D4_D6_GPIO_13_15 							0x4
#define UART_D2_0_UART_TDI_RTCK_D4_1_GPIO_14_15_D10_GPIO_12_13 		0x8
#define UART_D2_0_UART_Rx_Tx_D4_1_GPIO_8_9 							0x10
#define SPI_D2_TDM1_D4_GPIO_4_5_6_7_D10_GPIO_2_3_4_5 				0x20
#define SPI_D2_SPI_PINS_D6_GPIO_4_5_6_7 							0x40
#define UART_D2_0_ON_I2C_SDA_SCK 									0x80
#define SPI_ACK 													0x800

// LDO_CONFIGURATION_2B
#define LDO_DISABLE 		  0x0
#define LDO_ENABLE 			  0x1
#define LDO_CAS_OUT_LEVEL_1_2 0x2
#define LDO_CAS_OUT_LEVEL_1_8 0x4


// UART_DEBUG_RECORDING  0x30
#define ENABLE_RECORDING  0x1
#define ENLARGE_BUFFER_BY_1_5  0x2
#define ENLARGE_BUFFER_BY_2  0x4
#define ALLOCATE_BUFFER_IN_AHB_MEMORY  0x8
#define ADD_BUFFER_TO_HW_VAD  0x010
#define ENABLE_CALCULATING_MAX_VALUES  0x0100
#define PRINT_MAX_VALUES  0x0200
#define RECORD_MIC0_INT  0x1
#define RECORD_MIC1_INT  0x2
#define RECORD_MIC2_INT  0x4
#define RECORD_MIC3_INT  0x8
#define RECORD_MIC0_FRM  0x010
#define RECORD_MIC1_FRM  0x020
#define RECORD_MIC2_FRM  0x040
#define RECORD_MIC3_FRM  0x080
#define RECORD_TDM0_Rx_INT  0x0100
#define RECORD_TDM1_Rx_INT  0x0200
#define RECORD_TDM2_Rx_INT  0x0400
#define RECORD_TDM3_Rx_INT  0x0800
#define RECORD_TDM0_Tx_INT  0x1000
#define RECORD_TDM1_Tx_INT  0x2000
#define RECORD_TDM2_Tx_INT  0x4000
#define RECORD_TDM3_Tx_INT  0x8000
#define RECORD_TDM0_Rx_FRM  0x1
#define RECORD_TDM1_Rx_FRM  0x2
#define RECORD_TDM2_Rx_FRM  0x4
#define RECORD_TDM3_Rx_FRM  0x8
#define RECORD_TDM0_Tx_FRM  0x010
#define RECORD_TDM1_Tx_FRM  0x020
#define RECORD_TDM2_Tx_FRM  0x040
#define RECORD_TDM3_Tx_FRM  0x080
#define RECORD_BUF1_IN_FRM  0x0100
#define RECORD_BUF2_IN_FRM  0x0200
#define RECORD_BUF3_IN_FRM  0x0400
#define RECORD_BUF4_IN_FRM  0x0800
#define RECORD_BUF1_OUT_FRM  0x1000
#define RECORD_BUF2_OUT_FRM  0x2000
#define RECORD_BUF3_OUT_FRM  0x4000
#define RECORD_BUF4_OUT_FRM  0x8000
#define RECORD_VT_IN  0x1
#define RECORD_BUF_8_OUT  0x2
#define RECORD_BUF_9_OUT  0x4
#define RECORD_DECIM_IN_0  0x8
#define RECORD_DECIM_IN_1  0x010

//TDM_ACTIVATION_CONTROL  0x31
#define CONFIG_TDM_0  0x0
#define CONFIG_TDM_1  0x1
#define CONFIG_TDM_2  0x2
#define CONFIG_TDM_3  0x3
#define PROC_EN_DISABLE  0x0
#define PROC_EN_SWITCH_FW_TO_DETECTION_MODE  0x4
#define PROC_EN_SWITCH_FW_TO_BUFFERIG_MODE  0x8
#define TDM0_RX_EN  0x0100
#define TDM0_TX_EN  0x0200
#define TDM1_RX_EN  0x0400
#define TDM1_TX_EN  0x0800
#define TDM2_RX_EN  0x1000
#define TDM2_TX_EN  0x2000
#define TDM3_RX_EN  0x4000
#define TDM3_TX_EN  0x8000

// MEMORY_CONFIG  0x33

#define MIC_AUDIO_BUF_LOC_DTCM 						  0x0
#define MIC_AUDIO_BUF_LOC_AHB 						  0x400
#define AUDIO_BUF_LOC_DTCM_USING_MEM_ALLOCATION 	  0x0
#define AUDIO_BUF_LOC_AHB_USING_MEM_ALLOCATION 		  0x100
#define AUDIO_BUF_LOC_AHB_3_SEC_BUFFER 				  0x200
#define AUDIO_BUF_LOC_AHB_7_SEC_BUFFER_D8 			  0x300
#define AHB_ON_SIZE_NO_AHB 							  0x00
#define AHB_ON_SIZE_32KW_D4_32KW_D8_16KW_D10 		  0x08
#define AHB_ON_SIZE_64KW_D4_64KW_D8_32KW_D10 		  0x10
#define AHB_ON_SIZE_80KW_D4_80KW_D8_48KW_D10 		  0x18
#define AHB_ON_SIZE_112KW_D4_112KW_D8_64KW_D10 		  0x20
#define AHB_ON_SIZE_128KW_D4_128KW_D8_80KW_D10 		  0x28
#define AHB_ON_SIZE_128KW_D4_160KW_D8_96KW_D10 		  0x30
#define AHB_ON_SIZE_128KW_D4_192KW_D8_112KW_D10 	  0x38
#define AHB_ON_SIZE_128KW_D4_192KW_D8_128KW_D10 	  0x40
#define AHB_ON_SIZE_128KW_D4_192KW_D8_144KW_D10 	  0x48
#define AHB_ON_SIZE_128KW_D4_192KW_D8_160KW_D10 	  0x50
#define AHB_ON_SIZE_128KW_D4_192KW_D8_176KW_D10 	  0x58
#define AHB_ON_SIZE_128KW_D4_192KW_D8_192KW_D10 	  0x60
#define AHB_ON_SIZE_128KW_D4_192KW_D8_208KW_D10 	  0x68
#define AHB_ON_SIZE_128KW_D4_192KW_D8_224KW_D10 	  0x70
#define AHB_ON_SIZE_128KW_D4_192KW_D8_240KW_D10 	  0x78
#define AHB_ON_SIZE_128KW_D4_192KW_D8_256KW_D10 	  0x80

