anhpt26-zz/Apollo3_D10/boards/Apollo3_D10/device/d10_new/include/dx_fw_defs.h
#define DTCM_SIZE_NO_DTCM							  0
#define DTCM_SIZE_64KW_D4_64KW_D8_32KW_D10 			  0x1
#define DTCM_SIZE_96KW_D4_128KW_D8_64KW_D10 		  0x2
#define DTCM_SIZE_96KW_D4_192KW_D8_96KW_D10 		  0x3
#define DTCM_SIZE_96KW_D4_192KW_D8_128KW_D10 		  0x4
#define DTCM_SIZE_96KW_D4_192KW_D8_160KW_D10 		  0x5
#define DTCM_SIZE_96KW_D4_192KW_D8_192KW_D10 		  0x6

// command for AUDIO_PROCESSING_CONFIG_34 
#define ALGO1_EN_FW_MODE_1_ONLY 		0x1
#define ALGO1_EN_FW_MODE_2_ONLY 		0x2
#define ALGO1_EN_FW_MODE_1_AND_MODE_2 	0x3
#define ALGO2_EN_FW_MODE_1_ONLY 		0x4
#define ALGO2_EN_FW_MODE_2_ONLY 		0x8
#define ALGO2_EN_FW_MODE_1_AND_MODE_2 	0xC
#define I2S_CATCHUP_MODE_DISABLED 		0x0
#define I2S_CATCHUP_MODE_WRITE_16K_IN_48K_TDM 0x010
#define I2S_CATCHUP_MODE_ENABLED 		0x020
#define EN_441_EC_REF_DECIM 			0x080
#define AUTO_SET_HIGH_MIPS 				0x1000
#define POST_DETECTION_MODE_SWITCH_TO_STREAMING 0x0
#define POST_DETECTION_MODE_REMAIN_IN_DETECTION 0x2000
#define EN_48_EC_REF_DECIM 				0x4000
#define EN_COPY_HIST 					0x8000
#define VT_PROC_EN 0x0040
#define VT_CP0 0x0000
#define VT_CP1 0x0100
#define VT_CP2 0x0200
#define VT_CP3 0x0300
#define VT_CP4 0x0400
#define VT_CP5 0x0500
#define VT_CP6 0x0600
#define VT_CP7 0x0700

// TDM_RX_CONFIG  0x36 and TDM_TX_CONFIG  0x37
#define CLEAR_TDM_CFG  0x0
#define RX_TX_CP0  0x0
#define RX_TX_CP1  0x1
#define RX_TX_CP2  0x2
#define RX_TX_CP3  0x3
#define RX_TX_CP4  0x4
#define RX_TX_CP5  0x5
#define RX_TX_CP6  0x6
#define RX_TX_CP7  0x7
#define RX_TX_CP8  0x8
#define RX_TX_CP9  0x9
#define RX_TX_CP_VT_AUDIO_BUFFER  0xf
#define HW_BLOCK_EN  0x010
#define RESAMPLE_RATIO_NO_RESAMPLING  0x0
#define RESAMPLE_RATIO_2_AND_1_OR_44_1  0x020
#define RESAMPLE_RATIO_3_1  0x040
#define RESAMPLE_TYPE_DECIMATION  0x0
#define RESAMPLE_TYPE_INTERPOLATION  0x080
#define RX_TX_I2S_CH_USE_LOW_WORD_ONLY 0x0000
#define RX_TX_I2S_CH_USE_HIGH_WORD_ONLY 0x0100
#define RX_TX_I2S_CH_USE_I2S_STEREO  0x0000
#define RX_TX_I2S_CH_SUM_HIGH_AND_LOW_INTO_ONE_SAMPLE 0x0300
#define TX_I2S_CH_SUM_HIGH_AND_LOW_INTO_ONE_SAMPLE  0x100
#define TX_MASTER_CLOCK_ONLY  0x200
#define TX_FULL_OPERATION  0x0
#define INPUT_OUTPUT_SAMPLE_RATE_16_KHz  0x0
#define INPUT_OUTPUT_SAMPLE_RATE_44_1_KHz  0x0400
#define INPUT_OUTPUT_SAMPLE_RATE_48_KHz  0x0800
#define INPUT_OUTPUT_SAMPLE_RATE_8_KHz  0x0C00
#define NUM_OF_CHANNELS_1_CH  0x0
#define NUM_OF_CHANNELS_2_CH  0x1000
#define NUM_OF_CHANNELS_4_CH  0x2000
#define SAMPLE_WIDTH_16_BIT  0x0
#define SAMPLE_WIDTH_32_BIT  0x4000
#define DEMUX_MUX_DISABLE  0x0
#define DEMUX_MUX_ENABLE  0x8000

// Hardware TDM registers
#define D2_TDM_0_RX_ADDR  0x80800000
#define D2_TDM_1_RX_ADDR  0x80801000
#define D2_TDM_2_RX_ADDR  0x80802000
#define D2_TDM_3_RX_ADDR  0x80803000
#define D2_TDM_0_TX_ADDR  0x80804000
#define D2_TDM_1_TX_ADDR  0x80805000
#define D2_TDM_2_TX_ADDR  0x80806000
#define D2_TDM_3_TX_ADDR  0x80807000

#define D4_TDM_0_RX_ADDR   0x80800000
#define D4_TDM_1_RX_ADDR   0x80801000
#define D4_TDM_0_TX_ADDR   0x80804000
#define D4_TDM_0_TX_ADDR_A 0x8080400a
#define D4_TDM_1_TX_ADDR   0x80805000
#define D4_TDM_1_TX_ADDR_A 0x8080500a

#define D10_TDM_0_RX_ADDR  0x90000000
#define D10_TDM_1_RX_ADDR  0x90800000
#define D10_TDM_2_RX_ADDR  0x95000000
#define D10_TDM_0_TX_ADDR  0x90000400
#define D10_TDM_1_TX_ADDR  0x90800400
#define D10_TDM_2_TX_ADDR  0x9500040

// Hardware IOM registers
//BEN: I add D10_ prefix to avoid conflict with Apollo defitions
#define D10_IOM1				0x0300004C
#define D10_IOM2				0x03000050
#define GP_DATA_SET			0x04000004
#define GP_DATA_CLR			0x04000008
#define GP_DIR_OUT			0x04000010
#define CLK_DIV_1			0x300000C
#define AHB_PMOD			0x3000020

#define IOKE_ADDRESS  0x3000060
#define IOPE_ADDRESS  0x3000064
#define IOPV_ADDRESS  0x3000068

#define IOKE_VALUE  0xfdffff
#define IOPE_VALUE  0x20000
#define IOPV_VALUE  0x6007c6

#define MASK_UART_RX  0x20000
#define MASK_IO_PULL_DOWN  0x1DE4F1

#define BOOT_PRE_OP_CODE  0x5A
#define BOOT_LOAD_PAYLOAD_TO_PROG_MEM  0x01
#define BOOT_LOAD_PAYLOAD_TO_DATA_MEM  0x02
#define BOOT_WRITE_INT32_TO_AHB_ADDR  0x03
#define BOOT_WRITE_INT32_TO_APB_ADDR  0x04
#define BOOT_WRITE_INT32_TO_CPM_ADDR  0x05
#define BOOT_READ_INT32_FROM_AHB_ADDR  0x06
#define BOOT_READ_INT32_FROM_APB_ADDR  0x07
#define BOOT_READ_INT32_FROM_CPM_ADDR  0x08
#define BOOT_SET_MASK_VAL_TO_APB_REG  0x09
#define BOOT_CALL_FUNC_ADDR  0x0A
#define BOOT_RUN_FW  0x0B
#define BOOT_READ_INT32_FROM_PROG_ADDR  0x0C
#define BOOT_LOAD_3_PARAMS  0x0D
#define BOOT_READ_CHECKSUM  0x0E
#define BOOT_RESET_CHECKSUM  0x0F
#define BOOT_AUX_SERVICES  0x10
#define BOOT_AUX_SERV_EN_DATA_ECHO  0x1
#define BOOT_AUX_SERV_2_APB_WRITES  0x2
#define BOOT_AUX_SERV_PLL_SERVICE  0x3
#define BOOT_AUX_SWITCH_AUX_INTERFACE  0x4
#define BOOT_AUX_RUN_AUX_PREDEF_CODE  0x5
#define BOOT_FLASH_SERVICES  0x11
#define BOOT_READ_VER_NUM  0x12
#define BOOT_READ_BLOCK_OF_DATA_MEM  0x13
#define BOOT_OUTPUTS_MICS_SAPLES_PTT_MODE  0x14
#define BOOT_PTT_MODE_EN_DDF0  0x1
#define BOOT_PTT_MODE_EN_DDF1  0x2
#define BOOT_PTT_MODE_EN_SAR_DDF0  0x4
#define BOOT_PTT_MODE_EN_SAR_DDF1  0x8
#define BOOT_PTT_MODE_UART_OUT_16_BIT  0x10
#define BOOT_PTT_MODE_UART_OUT_24_BIT  0x20
#define BOOT_PTT_MODE_TDM_OUT_16_BIT  0x40
#define BOOT_PTT_MODE_TDM_OUT_32_BIT  0x80

// BUFFERING_NORMAL_AMPLITUDE_38
#define NORMALIZE_TO_MINUS_1dB 	0x3f
#define NORMALIZE_TO_MINUS_3dB 	0x3d
#define NORMALIZE_TO_MINUS_6dB 	0x3a
#define NORMALIZE_TO_MINUS_9dB 	0x37
#define NORMALIZE_TO_MINUS_18dB 0x2e
#define NO_NORMALIZATION 		0x0
#define USE_PHRASE_LEN_CONFIG_BY_HOST 	0x080
#define USE_PHRASE_LEN_FROM_WWE 		0x0
#define USER_CONFIG_PHRASE_LEN_500_MS 	0x3200
#define USER_CONFIG_PHRASE_LEN_600_MS 	0x3C00
#define USER_CONFIG_PHRASE_LEN_700_MS 	0x4600

// asrp gains - for regs 0x10a / 0x10b
#define ASRP_TX_OUT 					0x0
#define ASRP_VCPF_OUT 					0x1
#define ASRP_RX_OUT 					0x2

// asrp modules and fields
#define ASRP_OUTPUT_SRC_BFPF_1   0x0
#define ASRP_OUTPUT_SRC_BFPF_2   0x0100
#define ASRP_OUTPUT_SRC_VCPF_1   0x0200
#define ASRP_OUTPUT_SRC_BF_1   	 0x0300
#define ASRP_OUTPUT_SRC_AEC_1    0x0400
#define ASRP_OUTPUT_SRC_AEC_2    0x0500
#define ASRP_OUTPUT_SRC_AEC_3    0x0600
#define ASRP_OUTPUT_DEST_TX_1    0x0
#define ASRP_OUTPUT_DEST_TX_2    0x1
#define ASRP_OUTPUT_DEST_TX_3    0x2
#define ASRP_OUTPUT_DEST_TX_4    0x3
#define ASRP_OUTPUT_DEST_TX_5    0x4
#define ASRP_OUTPUT_DEST_TX_6    0x5
#define ASRP_OUTPUT_DEST_TX_7    0x6
#define ASRP_OUTPUT_DEST_TX_8    0x7

#define ASRP_REC_CH_TX_IN_1    0x1
#define ASRP_REC_CH_TX_IN_2    0x2
#define ASRP_REC_CH_TX_IN_3    0x4
#define ASRP_REC_CH_TX_IN_4    0x8
#define ASRP_REC_CH_RX_IN_1    0x010
#define ASRP_REC_CH_RX_IN_2    0x020
#define ASRP_REC_CH_RX_OUT_1   0x040

