anhpt26-zz/Apollo3_D10/boards/Apollo3_D10/device/d10_new/include/dx_fw_defs.h
// ASRP_RECORDS_CHANNELS_128 (0x128):
#define ASRP_REC_CH_TX_PROC_TX_IN_1    0x0100
#define ASRP_REC_CH_TX_PROC_TX_IN_2    0x0200
#define ASRP_REC_CH_TX_PROC_TX_IN_3    0x0400
#define ASRP_REC_CH_TX_PROC_RX_IN_1    0x1000
#define ASRP_REC_CH_TX_PROC_RX_IN_2    0x2000
#define ASRP_REC_CH_TX_PROC_RX_OUT_1   0x4000

// ASRP_RECORDS_CHANNELS_2 (0x129):
#define ASRP_REC_CH_TX_OUT_1    0x1
#define ASRP_REC_CH_TX_OUT_2    0x2
#define ASRP_REC_CH_TX_OUT_3    0x4


// VT_FRAME_SIZE  0x301

// VT_GENERAL_CFG  0x304
#define VT_EN_DIS  0x0
#define VT_EN_EN  0x1000
#define VT_ACTIVE  0x800
#define VT_PAUSE  0x0
#define SET_IN_CP  0x10
#define IN_CP_NUM_0  0x0
#define IN_CP_NUM_1  0x1
#define IN_CP_NUM_2  0x2
#define IN_CP_NUM_3  0x3
#define IN_CP_NUM_4  0x4
#define IN_CP_NUM_5  0x5
#define IN_CP_NUM_6  0x6
#define IN_CP_NUM_7  0x7

// VT_AUDIO_HISTORY_CFG  0x305
#define START_BUF_READ  0x1000
#define EXT_HIST_TIME_500MS  0x1F4
#define EXT_HIST_TIME_750MS  0x5DC
#define EXT_HIST_TIME_1S  0x3E8
#define HIST_POINT_IS_SWITCH_TO_BUFFER  0x0
#define HIST_POINT_IS_WW_END  0x1
#define HIST_POINT_IS_WW_START  0x2

// VT__RECORD_CFG  0x306
#define OUT_SIZE_SAME  0x0
#define OUT_SIZE_EXPANDED  0x200
#define MARK_DET  0x100
#define REC_OUT_DATA   0x10
#define REC_IN_DATA  0x1

// general
//BEN: Reduce SPI transfer size for Apollo
#define SPI_CHUNK 			2000  //0x8000		// Max chunk that FW / booter expets

#define CHECKSUM_SIZE		4

#define REG_WRITE_DELAY_NORMAL 	0.0005
#define REG_WRITE_DELAY_DEBUG 	0.015
#define NONE_OPTIMIZED_TL_FREQ 	150000
//#define NONE_OPTIMIZED_TL_FREQ 		140000
#define NONE_OPTMIZED_MEM_CFG 	0x186

#endif /* _DX_FW_DEFS_H */
